src/cf/DataProcessors/РаботаСРезультатамиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРезультатамиОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КоличествоБлокируемыхОбъектовКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КоличествоБлокируемыхОбъектовКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаВнешняяНавигационная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыБлокирующиеЗагрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыБлокирующиеЗагрузку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеТипа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФорматаКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПричиныДобавленияВРегистрОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВРегистрОбъектыКЗагрузке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗагрузкуДругихОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПолучениеЭтогоОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПоискСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКонвертации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоНаКонвертацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКЗагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОтклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/РаботаСРезультатамиОбмена/Forms/ФормаПроблемыОжидаетсяПолучениеЭтогоОбъекта/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьДанныеФормы();
	
	ОбработатьПереданныеПараметры(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеФормы();
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ВыполнитьДействияПриОткрытииФормы", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияНавигационнойСсылки(Ключ, Представление, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НавигационнаяСсылка = НавигационнаяСсылкаФормы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СоответствиеВИБСтрокаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "УстановитьСоответствие" Тогда
		
		ПриНачалеВыбораСоответствия(Элементы.СоответствиеВИБСтрока);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьСоответствие" Тогда
		
		СоответствиеВИБ = Неопределено;
		СформироватьТекстСоответствия(ЭтотОбъект);
		УправлениеДоступностью(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходВКомментарийОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВКомментарий" Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПерейтиВКомментарий(ЭтотОбъект, УзелИнформационнойБазы, ПолученныйОбъект, ОбъектФормата, ПравилоКонвертации, Комментарий);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РекомендацииПоРаботеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	
	СтандартнаяОбработка = Ложь;
	
	СсылкаСобытия = ДанныеСобытия.Href;
	
	Если СтрНайти(СсылкаСобытия, "ПерейтиНаСтраницуОсновное") Тогда
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОсновное;
		ТекущийЭлемент                         = Элементы.БлокируемыеОбъекты;
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "БлокируемыеОбъекты") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуБлокируемыеОбъекты(ЭтотОбъект, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы);
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "НаписатьКомментарий") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПерейтиВКомментарий(ЭтотОбъект, УзелИнформационнойБазы, ПолученныйОбъект, ОбъектФормата, ПравилоКонвертации, Комментарий);
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ОткрытьОбъектВИсточнике") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПерейтиПоВнешнейСсылкеНаОбъект(ВнешняяСсылкаНаОбъект, "РекомендацииПоРаботе");
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ОтклонитьЗагрузку") Тогда
		
		ОтметитьПроблемуРешенной();
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "УстановитьСоответствие") Тогда
		
		РаботаСРезультатамиОбменаКлиент.УстановитьСоответствиеВИБЕслиОтсутствует(
			ЭтотОбъект, СоответствиеВИБ, ПолноеИмяОбъектаМетаданных, "РекомендацииПоРаботе");
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБлокируемыеОбъекты

&НаКлиенте
Процедура БлокируемыеОбъектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФормуПроблемыБлокируемогоОбъекта();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСоответствие(Команда)
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораОбъектаДляУстановкиСоответствия(ЭтотОбъект, ПолноеИмяОбъектаМетаданных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъектВИсточнике(Команда)
	
	Если ЗначениеЗаполнено(ВнешняяСсылкаНаОбъект) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ВнешняяСсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроблемаРешена(Команда)
	
	ОтметитьПроблемуРешенной();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроблему(Команда)
	
	ОткрытьФормуПроблемыБлокируемогоОбъекта();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

&НаСервере
Процедура ИнициализироватьДанныеФормы()
	
	РаботаСРезультатамиОбмена.ИнициализироватьДанныеФормыПроблемы(ЭтотОбъект, "РекомендацииПроблемаТребуетсяПолучениеОбъекта");
	
	ЦветЗаголовкаЭлементаФормыПроблемы = ЦветаСтиля.ЦветЗаголовкаЭлементаФормыПроблемы;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)
	
	Если Параметры.ДанныеЗаписиОбъектКЗагрузке = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'В форму не передана информация о проблеме.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	РаботаСРезультатамиОбмена.ЗаполнитьРеквизитыФормыПроблемыПоПараметрам(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления                КАК ДатаВозникновения,
	|	ОбъектыКЗагрузке.ВнешняяСсылкаНаОбъект                         КАК ВнешняяСсылкаНаОбъект,
	|	ОбъектыКЗагрузке.КомментарийАдминистратора                     КАК Комментарий,
	|	ОбъектыКЗагрузке.ОбъектМетаданных                              КАК ОбъектМетаданных,
	|	ОбъектыКЗагрузке.ДатаОтправкиЗапросаНаВыгрузку                 КАК ДатаОтправкиЗапросаНаВыгрузку,
	|	ОбъектыКЗагрузке.ОбъектФормата                                 КАК ОбъектФормата,
	|	ЕСТЬNULL(КоличествоБлокируемыхОбъектовКЗагрузке.Количество, 0) КАК КоличествоБлокирует
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоБлокируемыхОбъектовКЗагрузке КАК КоличествоБлокируемыхОбъектовКЗагрузке
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект   = КоличествоБлокируемыхОбъектовКЗагрузке.ОбъектКПолучению
	|			И ОбъектыКЗагрузке.УзелПланаОбмена = КоличествоБлокируемыхОбъектовКЗагрузке.УзелПланаОбмена
	|ГДЕ
	|	ОбъектыКЗагрузке.ПолученныйОбъект = &ПолученныйОбъект
	|	И ОбъектыКЗагрузке.ПравилоКонвертации = &ПравилоКонвертации
	|	И ОбъектыКЗагрузке.ОбъектФормата = &ОбъектФормата
	|	И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелИнформационнойБазы";
	
	Запрос.УстановитьПараметр("ПолученныйОбъект",       ПолученныйОбъект);
	Запрос.УстановитьПараметр("ПравилоКонвертации",     ПравилоКонвертации);
	Запрос.УстановитьПараметр("ОбъектФормата",          ОбъектФормата);
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ВнешняяСсылкаНаОбъект          = Выборка.ВнешняяСсылкаНаОбъект;
	ДатаВозникновения              = Выборка.ДатаВозникновения;
	Комментарий                    = Выборка.Комментарий;
	ИдентификаторОбъектаМетаданных = Выборка.ОбъектМетаданных;
	ПредставлениеОбъектаМетаданных = Строка(Выборка.ОбъектМетаданных);
	БлокируетНепосредственно       = Выборка.КоличествоБлокирует;
	ДатаОтправкиЗапросаНаВыгрузку  = Выборка.ДатаОтправкиЗапросаНаВыгрузку;
	ИмяОбъектаФормата              = Выборка.ОбъектФормата;
	
	РаботаСРезультатамиОбмена.ЗаполнитьДанныеОбъектаМетаданныхВФормеПроблемы(ЭтотОбъект, Выборка.ОбъектМетаданных, Ложь);
	
	СформироватьТекстЗапросНаВыгрузку();
	СформироватьТекстСоответствия(ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьПереходВКомментарий(Элементы.ПереходВКомментарийДекорация, Комментарий, ЦветГиперссылки, КартинкаКомментарий);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТекстЗапросНаВыгрузку()

	Если ЗначениеЗаполнено(ДатаОтправкиЗапросаНаВыгрузку) Тогда
		
		ПредставлениеЗапросНаВыгрузку = СтрШаблон(НСтр("ru = 'Запрос на выгрузку отправлен - %1'"), Формат(ДатаОтправкиЗапросаНаВыгрузку, "ДЛФ=DT"));
		
	Иначе
		
		ПредставлениеЗапросНаВыгрузку = НСтр("ru = 'Запрос на выгрузку не отправлялся'");
		
	КонецЕсли;
	
	Элементы.ПредставлениеЗапросНаВыгрузку.Заголовок = Новый ФорматированнаяСтрока(ПредставлениеЗапросНаВыгрузку,, ЦветаСтиля.ЦветЗаголовкаЭлементаФормыПроблемы);

КонецПроцедуры

#КонецОбласти

#Область УстановкаСоответствия

&НаКлиенте
Процедура ПриНачалеВыбораСоответствия(ЭлементФормы)
	
	Если ЗначениеЗаполнено(ПолноеИмяОбъектаМетаданных) Тогда
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораОбъектаДляУстановкиСоответствия(ЭтотОбъект, ПолноеИмяОбъектаМетаданных);
		
	ИначеЕсли ВозможныеТипыОбъектовМетаданных.Количество() > 1 Тогда
		
		ПослеВыбораТипаСопоставляемогоОбъекта = Новый ОписаниеОповещения("ПослеВыбораТипаСопоставляемогоОбъекта", ЭтотОбъект);
		
		ПоказатьВыборИзМеню(ПослеВыбораТипаСопоставляемогоОбъекта, ВозможныеТипыОбъектовМетаданных, ЭлементФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТипаСопоставляемогоОбъекта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораОбъектаДляУстановкиСоответствия(ЭтотОбъект, Результат.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВозможныеТипыОбъектаМетаданныхЕслиНеобходимо()

	Если Не ПустаяСтрока(ПолноеИмяОбъектаМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияВозможныеТипыОбъектовМетаданных(УникальныйИдентификатор);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПолучитьВозможныеТипыОбъектаМетаданныхЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьВозможныеТипыОбъектаМетаданныхЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВозможныеТипыОбъектовМетаданных(УникальныйИдентификатор)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ПараметрыПроцедуры.Вставить("ИмяОбъектаФормата",      ИмяОбъектаФормата);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение возможных типов объектов метаданных по имени объекта формата'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("Обработки.РаботаСРезультатамиОбмена.ПолучитьВозможныеТипыОбъектаМетаданных",
		                                                    ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьВозможныеТипыОбъектаМетаданныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбработатьПолученныеВозможныеТипыОбъектовМетаданных(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПолученныеВозможныеТипыОбъектовМетаданных(АдресРезультата)
	
	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда 
		Возврат;
	КонецЕсли;
	
	ПолученныеДанные = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ПолученныеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ПолученныеДанные) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВозможныйТип Из ПолученныеДанные Цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ВозможныйТип);
		Если ОбъектМетаданных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВозможныеТипыОбъектовМетаданных.Добавить(ОбъектМетаданных.ПолноеИмя(), 
		                                         Строка(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных)));
		
	КонецЦикла;
	
	Если ВозможныеТипыОбъектовМетаданных.Количество() = 1 Тогда
		ПолноеИмяОбъектаМетаданных = ВозможныеТипыОбъектовМетаданных[0].Значение;
	КонецЕсли;
	
	СформироватьТекстСоответствия(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРучногоВыбораСоответствияИБ(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Действие = "ВопросЕслиСоответствиеЕсть" Тогда
		
		УжеСопоставленныеИдентификаторы = РезультатПроверкиВыбранногоСоответствия(Результат);
		
		Если УжеСопоставленныеИдентификаторы.Количество() > 0 Тогда
			
			РаботаСРезультатамиОбменаКлиент.ОткрытьФормуСоответствиеУжеУстановлено(ЭтотОбъект,
			                                                                       Результат,
			                                                                       УжеСопоставленныеИдентификаторы,
			                                                                       ДополнительныеПараметры,
			                                                                       УзелИнформационнойБазы);
			
		Иначе
			
			ОтразитьУстановленноеСоответствие(Результат);
			
		КонецЕсли;
			
	ИначеЕсли ДополнительныеПараметры.Действие = "УстановитьСоответствие" Тогда
		
		ОтразитьУстановленноеСоответствие(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьУстановленноеСоответствие(ВыбранныйОбъект)
	
	СоответствиеВИБ = ВыбранныйОбъект;
	СоответствиеУстановленоВЭтойФорме = Истина;
	
	СформироватьТекстСоответствия(ЭтотОбъект);
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция РезультатПроверкиВыбранногоСоответствия(ВыбранныйОбъект)
	
	ДанныеПроверкиПИСО = Новый Структура;
	ДанныеПроверкиПИСО.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ДанныеПроверкиПИСО.Вставить("Ссылка",                 ВыбранныйОбъект);
	
	Возврат РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныеИдентификаторыПриложенияСоответствующиеСсылке(ДанныеПроверкиПИСО);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьТекстСоответствия(Форма)
	
	ПараметрыФормирования = РаботаСРезультатамиОбменаКлиентСервер.НовыйПараметрыФормированияТекстаСоответствияВФормеПроблемы();
	ПараметрыФормирования.СоответствиеУстановленоВЭтойФорме = Форма.СоответствиеУстановленоВЭтойФорме;
	ПараметрыФормирования.ЦветГиперссылки                   = Форма.ЦветГиперссылки;
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьТекстСоответствияВФормеПроблемы(Форма, ПараметрыФормирования);
	
КонецПроцедуры

&НаСервере
Функция РезультатОтраженияРучногоСопоставления(ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы, СсылкаНаОбъект)
	
	РезультатОтражения = РаботаСРезультатамиОбмена.РезультатОтраженияРучногоСопоставления(ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы, СсылкаНаОбъект);
	
	Если РезультатОтражения.Успешно Тогда
		
		ДанныеЗаписи = РегистрыСведений.ОбъектыКЗагрузке.НовыйДанныеЗаписиРегистра();
		ДанныеЗаписи.ПолученныйОбъект   = ПолученныйОбъект;
		ДанныеЗаписи.ПравилоКонвертации = ПравилоКонвертации;
		ДанныеЗаписи.ОбъектФормата      = ОбъектФормата;
		ДанныеЗаписи.УзелПланаОбмена    = УзелИнформационнойБазы;
		
		РегистрыСведений.ОбъектыКЗагрузке.ОтразитьУспешнуюОбработкуОбъекта(ДанныеЗаписи);
		
	КонецЕсли;
	
	Возврат РезультатОтражения;
	
КонецФункции

#КонецОбласти

#Область БлокируемыеОбъекты

&НаКлиенте
Процедура ВыполнитьДействияПриОткрытииФормы()
	
	ПолучитьДанныеБлокируемыеОбъекты();
	ПолучитьВозможныеТипыОбъектаМетаданныхЕслиНеобходимо();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеБлокируемыеОбъекты()
	
	Если ДанныеОпосредованоПолучены
		Или БлокируетНепосредственно = 0 Тогда
		ДанныеОпосредованоПолучены = Истина;
		СформироватьПредставлениеБлокирует(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияБлокируемыеОбъекты(УникальныйИдентификатор);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПолучитьДанныеБлокируемыхОбъектовЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьДанныеБлокируемыхОбъектовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияБлокируемыеОбъекты(УникальныйИдентификатор)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПолученныйОбъект", ПолученныйОбъект);
	ПараметрыПроцедуры.Вставить("ОбъектФормата",    ОбъектФормата);
	ПараметрыПроцедуры.Вставить("УзелПланаОбмена",  УзелИнформационнойБазы);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение данных количества блокируемых объектов'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.ОбъектыБлокирующиеЗагрузку.ПолучитьДанныеБлокируемыхОбъектов",
	                                                       ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеБлокируемыхОбъектовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбработатьПолученныеДанныеБлокирует(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПолученныеДанныеБлокирует(АдресРезультата)

	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда 
		Возврат;
	КонецЕсли;
	
	ПолученныеДанные = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ПолученныеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ПолученныеДанные) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОпосредованоПолучены = Истина;
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("БлокируетНепосредственно");
	ИменаТаблиц.Добавить("БлокируетОпосредовано");
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
		
		Если ПолученныеДанные[ИмяТаблицы] = Неопределено Тогда
			ЭтотОбъект[ИмяТаблицы] = 0;
			Продолжить;
		КонецЕсли;
		
		РаботаСРезультатамиОбмена.ДобавитьСтрокиБлокируемыеОбъекты(БлокируемыеОбъекты, ПолученныеДанные[ИмяТаблицы]);
		
		ЭтотОбъект[ИмяТаблицы] = ПолученныеДанные[ИмяТаблицы].Количество();
		
	КонецЦикла;
	
	УправлениеДоступностью(ЭтотОбъект);
	СформироватьПредставлениеБлокирует(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеБлокирует(Форма)
	
	КоличествоБлокирует  = Форма.БлокируетНепосредственно + Форма.БлокируетОпосредовано;
	ТекстЗаголовка       = СтрШаблон(НСтр("ru='Блокируемые объекты (%1), для которых требуется получить данный объект'"), КоличествоБлокирует);
	ЗаголовокБлокируемые = Новый ФорматированнаяСтрока(ТекстЗаголовка, , Форма.ЦветЗаголовкаЭлементаФормыПроблемы);
	Форма.Элементы.ДекорацияБлокируемыеОбъекты.Заголовок = ЗаголовокБлокируемые;
	
	УправлениеДоступностью(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	Если Не ЗначениеЗаполнено(Форма.СоответствиеВИБ) Тогда
		
		ЭлементыФормы.ФормаПроблемаРешена.Видимость        = Ложь;
		ЭлементыФормы.ФормаУстановитьСоответствие.Видимость = Истина;
		
	Иначе 
		
		ЭлементыФормы.ФормаПроблемаРешена.Видимость         = Истина;
		ЭлементыФормы.ФормаУстановитьСоответствие.Видимость  = Ложь;
		
	КонецЕсли;
	
	Если Форма.ДанныеОпосредованоПолучены Тогда
		
		ЭлементыФормы.СтраницыБлокируемыеОбъектыФормирование.ТекущаяСтраница = ЭлементыФормы.СтраницаБлокируемыеОбъекты;
		
	Иначе
		
		ЭлементыФормы.СтраницыБлокируемыеОбъектыФормирование.ТекущаяСтраница = ЭлементыФормы.СтраницаФормированиеБлокируемыеОбъекты;
		
	КонецЕсли;
	
	ЭлементыФормы.ФормаОткрытьОбъектВИсточнике.Видимость = Не ПустаяСтрока(Форма.ВнешняяСсылкаНаОбъект);

КонецПроцедуры

#КонецОбласти

#Область ИзменениеКомментария

&НаКлиенте
Процедура ПослеЗакрытияФормыКомментария(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Комментарий = Результат;
	
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьПереходВКомментарий(Элементы.ПереходВКомментарийДекорация, Комментарий, ЦветГиперссылки, КартинкаКомментарий);
	
КонецПроцедуры

#КонецОбласти

#Область ФормаПроблемы

&НаКлиенте
Процедура ПослеЗакрытияФормыПроблемы(Результат, ДополнительныеПараметры) Экспорт

	Если Результат<> Неопределено Тогда
		ПолучитьДанныеБлокируемыеОбъекты();
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФормуПроблемыБлокируемогоОбъекта()
	
	ТекущиеДанные = Элементы.БлокируемыеОбъекты.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
	
	ДанныеЗаписи.ПолученныйОбъект   = ТекущиеДанные.ПолученныйОбъект;
	ДанныеЗаписи.ПравилоКонвертации = ТекущиеДанные.ПравилоКонвертации;
	ДанныеЗаписи.УзелПланаОбмена    = УзелИнформационнойБазы;
	ДанныеЗаписи.ОбъектФормата      = ТекущиеДанные.ОбъектФормата;
	
	ОповещениеОЗакрытииФормыПроблемы = Новый ОписаниеОповещения("ПослеЗакрытияФормыПроблемы", ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуПроблемы(
		ДанныеЗаписи, ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов"), ОповещениеОЗакрытииФормыПроблемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьПроблемуРешенной()
	
	РезультатУстановки = РезультатОтраженияРучногоСопоставления(ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы, СоответствиеВИБ);
	
	Если РезультатУстановки.Успешно Тогда
		
		РезультатОбработки = РаботаСРезультатамиОбменаКлиент.НовыйРезультатОбработкиВФормеПроблемы();
		РезультатОбработки.ПолученныйОбъект             = ПолученныйОбъект;
		РезультатОбработки.ПравилоКонвертации           = ПравилоКонвертации;
		РезультатОбработки.ОбъектФормата                = ОбъектФормата;
		РезультатОбработки.УстановленоСоответствие      = ЗначениеЗаполнено(СоответствиеВИБ);
		РезультатОбработки.ИдентификаторФоновогоЗадания = УникальныйИдентификатор;
		
		Оповестить("Запись_ПричинаДобавленияОбъектыКЗагрузке");
		
		Закрыть(РезультатОбработки);
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатУстановки.ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
